app/controllers/api/posts_controller.rb

SELECT "posts".* FROM "posts"
---
    def index
      posts = Post.all

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "asdfgh"], ["body", "vbnm,"], ["created_at", "2020-02-26 09:41:44.298032"], ["updated_at", "2020-02-26 09:41:44.298032"]]
---
    def create
      post = Post.create(post_params)